export const DistancesHard = {
    id: 2,
    time: 300,
    questions: [
        {
            id: 1,
            type: "piano",
            question: "فاصله #F تا کدام نت یک ششم کوچک است؟",
            answer: {
                correctOption: "D",
                descriptiveAnswer: "ششم کوچک یعنی 8 نیم‌پرده پس جواب سوال D است، زیرا فاصله بین #F تا D برابر 8 پرده است.",
            }
        },
        {
            id: 2,
            type: "test",
            question: "اگر فاصله C تا Eb را معکوس کنیم، چه فاصله‌ای به دست می‌آید؟",
            options: {
                1: "سوم بزرگ",
                2: "ششم کوچک",
                3: "ششم بزرگ",
                4: "پنجم کاسته",
            },
            answer: {
                correctOption: 3,
                descriptiveAnswer: "فاصله C تا Eb یک فاصله سوم کوچک است و طبق قائده فواصل معکوس(هر فاصله ای را اگر از ۹ کم کنیم به فاصله معکوس آن خواهیم رسید.) جواب سوال گزینه 3 است.( سوم کوچک - نهم = ششم بزرگ)",
            }
        },
        {
            id: 3,
            type: "test",
            question: "اگر معکوس یک فاصله، ششم بزرگ باشد، فاصله اصلی چه بوده است؟",
            options: {
                1: "سوم بزرگ",
                2: "سوم کوچک",
                3: "چهارم درست",
                4: "پنجم درست",
            },
            answer: {
                correctOption: 2,
                descriptiveAnswer: "طبق قائده فواصل معکوس(هر فاصله ای را اگر از ۹ کم کنیم به فاصله معکوس آن خواهیم رسید.) جواب سوال گزینه 3 است.(پنجم درست - نهم = چهارم درست)",
            }
        },
        {
            id: 4,
            type: "test",
            question: "یک هنرجو نوشته است: «فاصله C تا #F یک پنجم افزوده است.» مشخص کن که او اشتباهی دارد یا نه ، اگر اشتباهی دارد، اشتباه اون چیست؟",
            options: {
                1: "هیچ اشتباهی ندارد.",
                2: "باید چهارم افزوده باشد.",
                3: "باید پنجم کاسته باشد.",
                4: "باید چهارم درست باشد.",
            },
            answer: {
                correctOption: 2,
                descriptiveAnswer: "فاصله بین C تا F# یک چهارم افزوده است. زیرا از ۶ پرده تشکیل شده است و از C تا F چهار نت طی شده است.",
            }
        },
        {
            id: 5,
            type: "test",
            question: "فاصله D-A یک پنجم درست است. اگر D را یک نیم‌پرده پایین بیاوریم، فاصله جدید چیست؟",
            options: {
                1: "پنجم افزوده",
                2: "پنجم کاسته",
                3: "ششم کوچک",
                4: "چهارم درست",
            },
            answer: {
                correctOption: 1,
                descriptiveAnswer: "زیرا نت D که نت اولیه فاصله هست را نیم پرده کم کرده‌ایم پس خود فاصله نیم پرده افزایش یافته است.",
            }
        },
        {
            id: 6,
            type: "test",
            question: "فاصله C-A را داریم. C را یک نیم‌پرده بالا و A را یک نیم‌پرده پایین می‌بریم. فاصله جدید چیست؟",
            options: {
                1: "پنجم درست",
                2: "پنجم کاسته",
                3: "چهارم افزوده",
                4: "ششم کاسته",
            },
            answer: {
                correctOption: 4,
                descriptiveAnswer: "فاصله C تا A یک ششم بزرگ است، و اگر C را نیم پرده به بالا و A را نیم پرده به پایین بیاوریم، از کل فاصله ۱ پرده کم می‌شود. که پاسخ سوال ششم کاسته است.",
            }
        },
        {
            id: 7,
            type: "test",
            question: "کدام دو فاصله ممکن است از نظر صدایی یکسان باشند ولی نام تئوریک متفاوتی داشته باشند؟",
            options: {
                1: "سوم بزرگ و چهارم کاسته",
                2: "پنجم درست و چهارم افزوده",
                3: "دوم کوچک و اول افزوده",
                4: "الف و ج",
            },
            answer: {
                correctOption: 4,
                descriptiveAnswer: "سوم بزرگ و چهارم کاسته هر دو ۲ پرده و دوم کوچک و اول افزوده هر دو نیم پرده هستند، پس از نظر صدایی یکسان هستند و فقط از نظر اسمی متفاوت هستند.",
            }
        },
        {
            id: 8,
            type: "test",
            question: "از Bb شروع کن: ابتدا یک سوم کوچک بالا برو. سپس یک دوم بزرگ بالا برو. اکنون روی چه نتی قرار می‌گیری؟",
            options: {
                1: "Db",
                2: "D",
                3: "Eb",
                4: "E",
            },
            answer: {
                correctOption: 3,
                descriptiveAnswer: "اگر از Bb یک سوم کوچک بالا برویم به نت Db می‌رسیم و اگر از Db یک دوم بزرگ بالا برویم به Eb می‌رسیم.",
            }
        },
        {
            id: 9,
            type: "piano",
            question: "نت Gb را در نظر بگیر. اگر ابتدا یک چهارم افزوده به بالا برویم و سپس یک سوم کوچک به پایین برگردیم، به چه نتی می‌رسیم؟",
            answer: {
                correctOption: "A",
                descriptiveAnswer: "اگر از نت Gb یک چهارم افزوده به بالا برویم به نت C میرسیم و اگر از C یک سوم کوچک به پایین برگردیم به A میرسیم.",
            }
        },
        {
            id: 10,
            type: "test",
            question: "فاصله بین #D و Bb را از نظر نام تئوریک و تعداد نیم‌پرده مشخص کنید.",
            options: {
                1: "ششم کوچک - 8 نیم‌پرده",
                2: "ششم کاسته - 7 نیم‌پرده",
                3: "ششم کوچک - 9 نیم‌پرده",
                4: "پنجم افزوده - 8 نیم‌پرده",
            },
            answer: {
                correctOption: 2,
                descriptiveAnswer: "فاصله #D و Bb یک ششم کاسته است، زیرا 7 نیم‌پرده فاصله دارند.",
            }
        },
    ]
}